# Imports

In [50]:
# imports
import datetime
import pandas as pd
import numpy as np
from vega_datasets import data as vds
# pd.__version__

# Create A Date Range

In [51]:
# create a date range
date_range = pd.date_range(start='1-1-16', end='1-31-16')
date_range

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10', '2016-01-11', '2016-01-12',
               '2016-01-13', '2016-01-14', '2016-01-15', '2016-01-16',
               '2016-01-17', '2016-01-18', '2016-01-19', '2016-01-20',
               '2016-01-21', '2016-01-22', '2016-01-23', '2016-01-24',
               '2016-01-25', '2016-01-26', '2016-01-27', '2016-01-28',
               '2016-01-29', '2016-01-30', '2016-01-31'],
              dtype='datetime64[ns]', freq='D')

In [52]:
type(date_range)

pandas.core.indexes.datetimes.DatetimeIndex

# Add Dates To Dataframe

In [53]:
# add dates to dataframe
df_day_names = pd.DataFrame({'Dates': date_range,
                             'A': np.arange(1,32),
                             'B': np.random.rand(31)})

df_day_names.head()

       Dates  A         B
0 2016-01-01  1  0.390743
1 2016-01-02  2  0.250177
2 2016-01-03  3  0.330672
3 2016-01-04  4  0.312632
4 2016-01-05  5  0.372673

In [54]:
type(df_day_names.Dates)

pandas.core.series.Series

In [55]:
df_day_names.dtypes

Dates    datetime64[ns]
A                 int64
B               float64
dtype: object

# Make Dates Column The Index

In [56]:
# make dates column the index
df_day_names_date_index = df_day_names.set_index('Dates', inplace=False)
df_day_names_date_index.head()

            A         B
Dates
2016-01-01  1  0.390743
2016-01-02  2  0.250177
2016-01-03  3  0.330672
2016-01-04  4  0.312632
2016-01-05  5  0.372673

In [57]:
type(df_day_names_date_index.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [58]:
pd.Series.dt?

# Add Day Name To DataFrame

In [59]:
# add day name to dataframe
# *** see pd.Series.dt accessor list at bottom of notebook ***
df_day_names['Days'] = df_day_names['Dates'].dt.day_name()
print(df_day_names.head(),'\n')
print(df_day_names.dtypes)

       Dates  A         B      Days
0 2016-01-01  1  0.390743    Friday
1 2016-01-02  2  0.250177  Saturday
2 2016-01-03  3  0.330672    Sunday
3 2016-01-04  4  0.312632    Monday
4 2016-01-05  5  0.372673   Tuesday

Dates    datetime64[ns]
A                 int64
B               float64
Days             object
dtype: object

# More Date Range Examples

In [60]:
# date range example using frequency and periods
# *** see common time series frequencies list at bottom of notebook ***
pd.date_range('2016', freq='D', periods=31)

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10', '2016-01-11', '2016-01-12',
               '2016-01-13', '2016-01-14', '2016-01-15', '2016-01-16',
               '2016-01-17', '2016-01-18', '2016-01-19', '2016-01-20',
               '2016-01-21', '2016-01-22', '2016-01-23', '2016-01-24',
               '2016-01-25', '2016-01-26', '2016-01-27', '2016-01-28',
               '2016-01-29', '2016-01-30', '2016-01-31'],
              dtype='datetime64[ns]', freq='D')

In [61]:
# period range example
period_range = pd.period_range('1/1/2016', freq='M', periods=12)
period_range

PeriodIndex(['2016-01', '2016-02', '2016-03', '2016-04', '2016-05', '2016-06',
             '2016-07', '2016-08', '2016-09', '2016-10', '2016-11', '2016-12'],
            dtype='period[M]', freq='M')

In [62]:
# add month name
# details of the string format can be found in python string format doc
# dt.month_name() does not work with PeriodProperties, so we use dt.strftime('%B') instead
df_periods = pd.DataFrame({'A': np.random.rand(12),
                           'Dates': period_range})

df_periods['month'] = df_periods.Dates.dt.strftime('%B')

df_periods

           A    Dates      month
0   0.774452  2016-01    January
1   0.201617  2016-02   February
2   0.416983  2016-03      March
3   0.956292  2016-04      April
4   0.583920  2016-05        May
5   0.977335  2016-06       June
6   0.375554  2016-07       July
7   0.492330  2016-08     August
8   0.166677  2016-09  September
9   0.111706  2016-10    October
10  0.001211  2016-11   November
11  0.460275  2016-12   December

In [63]:
# use DatetimeIndex to create dates
dti = pd.DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03'])

df_dti = pd.DataFrame({'Dates': dti,
                       'A': np.random.rand(3)})

df_dti

       Dates         A
0 2016-01-01  0.526135
1 2016-01-02  0.028453
2 2016-01-03  0.032760

# Extract Parts Of Date Column To Make New Columns

In [64]:
# extract parts of date column to make new columns

# temperature example
weather = vds.seattle_weather()

# add month columns to df
weather['month_num'] = weather['date'].dt.month
weather['month'] = weather['date'].dt.month_name()
print(weather.dtypes)
weather.head()

date             datetime64[ns]
precipitation           float64
temp_max                float64
temp_min                float64
wind                    float64
weather                  object
month_num                 int64
month                    object
dtype: object

,date,precipitation,temp_max,temp_min,wind,weather,month_num,month
0,2012-01-01,0.0,12.8,5.0,4.7,drizzle,1,January
1,2012-01-02,10.9,10.6,2.8,4.5,rain,1,January
2,2012-01-03,0.8,11.7,7.2,2.3,rain,1,January
3,2012-01-04,20.3,12.2,5.6,4.7,rain,1,January
4,2012-01-05,1.3,8.9,2.8,6.1,rain,1,January

In [65]:
pd.Series.dt.month?

In [66]:
pd.Series.dt.month_name?

# Import Dates

In [ ]:
# import dates
# import_dates_data = pd.read_csv('path/Dates Data.csv')
# print(import_dates_data.dtypes,'\n')

# convert to datetime64 data type
# import_dates_data['Dates'] = pd.to_datetime(import_dates_data['Dates'])
# print(import_dates_data.dtypes)

# import_dates_data.head()

# Aggregation With Resample

In [68]:
# weather_by_month.resample?
# resample must have a datetime-like index

In [69]:
# aggregation with resample
# checked against pivot table and results were the same
seattle_weather = vds.seattle_weather()
weather_aggregation = seattle_weather.set_index('date')
weather_aggregation.resample('Y').mean()

            precipitation   temp_max  temp_min      wind
date
2012-12-31       3.349727  15.276776  7.289617  3.400820
2013-12-31       2.268493  16.058904  8.153973  3.015890
2014-12-31       3.377534  16.995890  8.662466  3.387671
2015-12-31       3.121096  17.427945  8.835616  3.159726

# Filtering For Certain Dates
filtering for certain dates (i.e.-specific year, range of dates, etc.)

In [70]:
# create dataframe with date range
df_slice_range = pd.date_range(start='1-1-16', end='12-31-16')
df_slice_range_len = len(df_slice_range) 
df_slice = pd.DataFrame({'Dates': df_slice_range,
                         'A': np.arange(df_slice_range_len),
                         'B': np.random.rand(df_slice_range_len)})

df_slice.tail()

         Dates    A         B
361 2016-12-27  361  0.623522
362 2016-12-28  362  0.032954
363 2016-12-29  363  0.187578
364 2016-12-30  364  0.015173
365 2016-12-31  365  0.152069

In [71]:
# filter dates with slice

# increase rows shown
# pd.set_option('display.max_rows', 100)

# set index and filter dates with slice
df_slice.set_index('Dates')['3-26-16':'4-15-16']
# another example to show slice of March - April ['2016-3':'2016-4']

              A         B
Dates
2016-03-26   85  0.774018
2016-03-27   86  0.620944
2016-03-28   87  0.303174
2016-03-29   88  0.363410
2016-03-30   89  0.218370
2016-03-31   90  0.322646
2016-04-01   91  0.050680
2016-04-02   92  0.492320
2016-04-03   93  0.741827
2016-04-04   94  0.713751
2016-04-05   95  0.459655
2016-04-06   96  0.459717
2016-04-07   97  0.993958
2016-04-08   98  0.264725
2016-04-09   99  0.953448
2016-04-10  100  0.643884
2016-04-11  101  0.702914
2016-04-12  102  0.524046
2016-04-13  103  0.596386
2016-04-14  104  0.209974
2016-04-15  105  0.608939

In [72]:
# truncate (similar to slice)
df_trunc = df_slice.copy()
df_trunc.set_index('Dates').truncate(before='4-18-16', after='5-5-16')

              A         B
Dates
2016-04-18  108  0.201776
2016-04-19  109  0.061190
2016-04-20  110  0.637368
2016-04-21  111  0.205913
2016-04-22  112  0.967833
2016-04-23  113  0.581385
2016-04-24  114  0.384787
2016-04-25  115  0.637728
2016-04-26  116  0.100101
2016-04-27  117  0.931146
2016-04-28  118  0.177302
2016-04-29  119  0.962039
2016-04-30  120  0.673924
2016-05-01  121  0.831651
2016-05-02  122  0.288473
2016-05-03  123  0.440544
2016-05-04  124  0.099003
2016-05-05  125  0.829979

In [73]:
# show only specified dates with boolean filter/indexing
df_slice.loc[df_slice.Dates >= pd.to_datetime('12-15-16'), :]

         Dates    A         B
349 2016-12-15  349  0.097205
350 2016-12-16  350  0.333340
351 2016-12-17  351  0.627953
352 2016-12-18  352  0.696095
353 2016-12-19  353  0.854107
354 2016-12-20  354  0.574426
355 2016-12-21  355  0.067974
356 2016-12-22  356  0.229841
357 2016-12-23  357  0.465165
358 2016-12-24  358  0.970604
359 2016-12-25  359  0.949555
360 2016-12-26  360  0.870411
361 2016-12-27  361  0.623522
362 2016-12-28  362  0.032954
363 2016-12-29  363  0.187578
364 2016-12-30  364  0.015173
365 2016-12-31  365  0.152069

In [74]:
df_slice.Dates >= pd.to_datetime('12-15-16')

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
336    False
337    False
338    False
339    False
340    False
341    False
342    False
343    False
344    False
345    False
346    False
347    False
348    False
349     True
350     True
351     True
352     True
353     True
354     True
355     True
356     True
357     True
358     True
359     True
360     True
361     True
362     True
363     True
364     True
365     True
Name: Dates, Length: 366, dtype: bool

# Convert Argument To Datetimes

In [75]:
pd.to_datetime?

In [76]:
# to_datetime
# different formats
# use dayfirst=True if day is first
# datetime64[ns] types, NaT represents missing values
to_date = pd.to_datetime(pd.Series(['jan 1, 2016', '2016-01-20', '12-21-2016', '31-1-2016', None]))

to_date

0   2016-01-01
1   2016-01-20
2   2016-12-21
3   2016-01-31
4          NaT
dtype: datetime64[ns]

In [77]:
# dataframe with to_date dates example
df_to_date = pd.DataFrame({'Dates': to_date,
                           'A': np.random.rand(5),
                           'B': np.random.rand(5)})

df_to_date

       Dates         A         B
0 2016-01-01  0.114209  0.580497
1 2016-01-20  0.338094  0.059020
2 2016-12-21  0.933037  0.694139
3 2016-01-31  0.836397  0.484166
4        NaT  0.829671  0.847919

In [78]:
df_to_date.dtypes

Dates    datetime64[ns]
A               float64
B               float64
dtype: object

# Show Only Certain Dates - Custom Business Day Dates

using bdate_range weekmask

In [79]:
# show only certain dates using bdate_range and weekmask
# return a fixed frequency DatetimeIndex, with business day as the default
# freq=C for custom business day frequency

# days to be shown
weekmask = 'Tue Wed Thu'

business_days = pd.bdate_range(start=datetime.datetime(2016, 12, 1), 
                               end=datetime.datetime(2016, 12, 31), 
                               freq='C', 
                               weekmask=weekmask)

business_days

DatetimeIndex(['2016-12-01', '2016-12-06', '2016-12-07', '2016-12-08',
               '2016-12-13', '2016-12-14', '2016-12-15', '2016-12-20',
               '2016-12-21', '2016-12-22', '2016-12-27', '2016-12-28',
               '2016-12-29'],
              dtype='datetime64[ns]', freq='C')

In [80]:
pd.bdate_range?

# Calculations

In [81]:
# dataframe
df_dates = pd.date_range(start='1-1-16', end='12-31-16')
df_range_len = len(df_dates) 
df = pd.DataFrame({'Dates': df_dates,
                   'A': np.arange(df_range_len),
                   'B': np.random.rand(df_range_len)})

df.tail()

         Dates    A         B
361 2016-12-27  361  0.318606
362 2016-12-28  362  0.465604
363 2016-12-29  363  0.859933
364 2016-12-30  364  0.642918
365 2016-12-31  365  0.396601

In [82]:
# min and max dates
print(df.Dates.max(),'\n')
print(df.Dates.min())

2016-12-31 00:00:00

2016-01-01 00:00:00

In [83]:
# add time to get new date
timestamp = pd.Timestamp('2016-01-31')
add_days = timestamp + pd.Timedelta('81 days')
add_days

Timestamp('2016-04-21 00:00:00')

In [84]:
# subtract date times to get total time
timestamp_1 = pd.Timestamp('2016-01-01 17:00:00')
timestamp_2 = pd.Timestamp('2016-01-01 18:00:00')

(timestamp_2 - timestamp_1)

Timedelta('0 days 01:00:00')

In [85]:
# added after tutorial
df_subtract_times = pd.DataFrame({'Dates1': [pd.Timestamp('2016-01-01 17:00:00')],
                                  'Dates2': [pd.Timestamp('2016-02-02 18:45:00')]})
df_subtract_times['difference'] = df_subtract_times.Dates2 - df_subtract_times.Dates1
df_subtract_times

               Dates1              Dates2       difference
0 2016-01-01 17:00:00 2016-02-02 18:45:00 32 days 01:45:00

In [86]:
# calculate time units within time units

# total seconds
total_seconds = pd.Timedelta('1 hour').total_seconds()
print('total seconds in 1 hour', total_seconds)

# total minutes
total_minutes = pd.Timedelta('2 days 1 hour 5 min') / pd.Timedelta('1 min')
print('total minutes', total_minutes)

# total hours
total_hours = pd.Timedelta('365 days') / pd.Timedelta('1 hour')
print('total hours', total_hours)

total seconds in 1 hour 3600.0
total minutes 2945.0
total hours 8760.0

# Accessors For Datetimelike Properties
pd.Series.dt accessor list

some are properties and some are functions

In [ ]:
# pd.Series.dt accessor list
# some are properties and some are functions
'''
asfreq, ceil, components, date, day, day_name, dayofweek, dayofyear, days, days_in_month, daysinmonth, 
end_time, floor, freq, hour, is_leap_year, is_month_end, is_month_start, is_quarter_end, is_quarter_start, 
is_year_end, is_year_start, microsecond, microseconds, minute, month, month_name, mro, nanosecond, 
nanoseconds, normalize, quarter, qyear, round, second, seconds, start_time, strftime, time, timetz, 
to_period, to_pydatetime, to_pytimedelta, to_timestamp, total_seconds, tz, tz_convert, tz_localize, week, 
weekday, weekday_name, weekofyear, year
'''

# Common Time Series Frequencies

In [ ]:
'''
Common Time Series Frequencies

Alias     Description
B         business day frequency
C         custom business day frequency
D         calendar day frequency
W         weekly frequency
M         month end frequency
SM        semi-month end frequency (15th and end of month)
BM        business month end frequency
CBM       custom business month end frequency
MS        month start frequency
SMS       semi-month start frequency (1st and 15th)
BMS       business month start frequency
CBMS      custom business month start frequency
Q         quarter end frequency
BQ        business quarter end frequency
QS        quarter start frequency
BQS       business quarter start frequency
A, Y      year end frequency
BA, BY    business year end frequency
AS, YS    year start frequency
BAS, BYS  business year start frequency
BH        business hour frequency
H         hourly frequency
T, min    minutely frequency
S         secondly frequency
L, ms     milliseconds
U, us     microseconds
N         nanoseconds
'''